import numpy as np

# 1. 배열의 인덱싱
x = np.array([10,20,30,40,50])
print(x[0]) # 10
print(x[-2]) # 40
print(x[[0,2]]) # [[특정인덱스, 특정인덱스]] , [10 30]
print(x[x>20]) # [논리조건] , [30 40 50]

# 2. 2차원 인덱싱
x = np.array([[1,2,3],[4,5,6],[7,8,9]])
print(x[0,0]) # 0행 0열 , 1
print(x[1,2]) # 1행 2열 , 6
print(x[-1,-2]) # 마지막행 마지막열 , 8
print(x[x>5]) # [6 7 8 9]

# 3. 슬라이싱
x = np.array([10,20,30,40,50])
print(x[1:4]) # [20 30 40]
print(x[:3]) # 시작인덱스 생략시 0
print(x[-3:]) # 끝인덱스 생략시 마지막인덱스
print(x[::2]) # 2칸씩 이동

# 4. 2차원 슬라이싱
x = np.array([[1,2,3],[4,5,6],[7,8,9]])
# print(x[행슬라이싱, 열스라이싱])
print(x[:,1]) # 행: 전체, 열: 1열 , [2 5 8]
print(x[1,:]) # 행: 1행 , 열: 전체 , [4 5 6]
print(x[0:2, 1:3]) # 0~1행, 1~2열 [[2 3] [5 6]]

# 5. 슬라이싱 주의할점 :
x = np.array([10,20,30,40,50])
y = x[1:4]
y[0] = 100
print(x) # 원본 확인시 원본도 같이 변경